app/views/admin/eqpfamily_show.html.erb

<table>
	<% @eqpfamily.eqpgroups.each do |eqpgroup| %>
---
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."eqpfamily_id" = 1 ORDER BY indx