app/views/admin/eqpgroup_show.html.erb

SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."eqpgroup_id" = 1 ORDER BY indx
---
<table>
	<% @eqpgroup.eqptypes.each do |eqptype| %>