app/views/admin/eqptype_show.html.erb

<table>
	<% @eqptype.eqps.each do |eqp| %>
---
SELECT "eqps".* FROM "eqps" WHERE "eqps"."eqptype_id" = 3 ORDER BY indx