app/controllers/admin_controller.rb

	def eqptype_moveup
		@eqpgroup = Eqpgroup.find(params[:eqpgroup_id])
---
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = ? LIMIT 1  [["id", "2"]]

	def eqp_destroy
		@eqptype = Eqptype.find(params[:id])
---
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."id" = 6 LIMIT 1

	def eqp_update
		@eqptype = Eqptype.find(params[:eqptype_id])
---
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."id" = 6 LIMIT 1

	def eqp_edit
		@eqptype = Eqptype.find(params[:eqptype_id])
---
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."id" = 5 LIMIT 1