app/controllers/admin_controller.rb

	def index
		@title = "Администрирование"
		@eqpfamilies = Eqpfamily.find(:all, :order => 'indx')
		@eqpfamilies.each do |eqpfamily|
			eqpfamily.indx = @eqpfamilies.index(eqpfamily)
			eqpfamily.indx = eqpfamily.indx * 2
			eqpfamily.save
---
SELECT "eqpfamilies".* FROM "eqpfamilies" ORDER BY indx
UPDATE "eqpfamilies" SET "indx" = 0, "updated_at" = '2011-12-06 04:10:10.357662' WHERE "eqpfamilies"."id" = 1

	def eqpfamily_create
		@eqpfamily = Eqpfamily.new(params[:eqpfamily])
		@eqpfamily.indx = 9999
		respond_to do |format|
			if @eqpfamily.save
---
INSERT INTO "eqpfamilies" ("created_at", "indx", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 06 Dec 2011 04:10:09 UTC +00:00], ["indx", 9999], ["name", "привет"], ["updated_at", Tue, 06 Dec 2011 04:10:09 UTC +00:00]]

	def eqpfamily_show
		@title = "Просмотр элементов бокового меню"
		@eqpfamily = Eqpfamily.find(params[:id])
		@eqpfamily.eqpgroups.each do |eqpgroup|
			eqpgroup.indx = @eqpfamily.eqpgroups.index(eqpgroup)
			eqpgroup.indx = eqpgroup.indx * 2
			eqpgroup.save
---
SELECT "eqpfamilies".* FROM "eqpfamilies" WHERE "eqpfamilies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "eqpfamilies".* FROM "eqpfamilies" ORDER BY indx
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."eqpfamily_id" = 1 ORDER BY indx
UPDATE "eqpgroups" SET "indx" = 0, "updated_at" = '2011-12-06 04:13:53.963966' WHERE "eqpgroups"."id" = 1

	def eqpfamily_edit
		@title = "Редактирование элемента бокового меню"
		@eqpfamily = Eqpfamily.find(params[:id])
---
SELECT "eqpfamilies".* FROM "eqpfamilies" WHERE "eqpfamilies"."id" = ? LIMIT 1  [["id", "5"]]

	def eqpfamily_update
		@eqpfamily = Eqpfamily.find(params[:id])
---
SELECT "eqpfamilies".* FROM "eqpfamilies" WHERE "eqpfamilies"."id" = ? LIMIT 1  [["id", "5"]]

	def eqpfamily_destroy
		@eqpfamily = Eqpfamily.find(params[:id])
		@eqpfamily.destroy
---
SELECT "eqpfamilies".* FROM "eqpfamilies" WHERE "eqpfamilies"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "eqpfamilies" WHERE "eqpfamilies"."id" = ?  [["id", 1]]

	def eqpfamily_moveup
		eqpfamily = Eqpfamily.find(params[:id])
		eqpfamilies = Eqpfamily.all
		indx = eqpfamily.indx
		eqpfamily.indx=eqpfamily.indx-3
		eqpfamily.save
---
SELECT "eqpfamilies".* FROM "eqpfamilies" WHERE "eqpfamilies"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "eqpfamilies".* FROM "eqpfamilies"
UPDATE "eqpfamilies" SET "indx" = -1, "updated_at" = '2011-12-06 04:27:59.843796' WHERE "eqpfamilies"."id" = 2

	def eqpgroup_create
		@eqpgroup = Eqpgroup.new(params[:eqpgroup])
		@eqpfamily = Eqpfamily.find(params[:id])
		@eqpgroup.eqpfamily = @eqpfamily
		@eqpgroup.indx = 9999
		respond_to do |format|
			if @eqpgroup.save
---
SELECT "eqpfamilies".* FROM "eqpfamilies" WHERE "eqpfamilies"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "eqpgroups" ("created_at", "description", "eqpfamily_id", "indx", "name", "p1", "p2", "p3", "p4", "pn", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def eqpgroup_destroy
		@eqpfamily = Eqpfamily.find(params[:eqpfamily_id])
		@eqpgroup = Eqpgroup.find(params[:id])
		@eqpgroup.destroy
---
SELECT "eqpfamilies".* FROM "eqpfamilies" WHERE "eqpfamilies"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "eqpgroups" WHERE "eqpgroups"."id" = ?  [["id", 8]]

	def eqpgroup_update
		@eqpfamily = Eqpfamily.find(params[:eqpfamily_id])
		@eqpgroup = Eqpgroup.find(params[:id])
		respond_to do |format|
			if @eqpgroup.update_attributes(params[:eqpgroup])
---
SELECT "eqpfamilies".* FROM "eqpfamilies" WHERE "eqpfamilies"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "eqpgroups" SET "description" = 'Холодильная камера предназначена для заморозки и хранения всевозможных пищевых продуктов, фармацевтических препаратов, а также цветов и изделий из меха. Холодильные камеры выпускаются с большим спектром объемов и оснащаются холодильными моноблоками и сплит-системами различной холодопроизводительности. Холодильные камеры представляют собой сборную модульную систему из сендвич-панелей, которые с помощью специальных профилей легко соединяются между собой.

	def eqpgroup_show
		@title = "Просмотр элемента бокового меню второго уровня"
		@eqpfamily = Eqpfamily.find(params[:eqpfamily_id])
		@eqpgroup = Eqpgroup.find(params[:id])
		@eqpgroup.eqptypes.each do |eqptype|
			eqptype.indx = @eqpgroup.eqptypes.index(eqptype)
			eqptype.indx = eqptype.indx * 2
			eqptype.save
---
SELECT "eqpfamilies".* FROM "eqpfamilies" WHERE "eqpfamilies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."eqpgroup_id" = 1 ORDER BY indx
UPDATE "eqptypes" SET "indx" = 0, "updated_at" = '2011-12-08 05:19:48.214130' WHERE "eqptypes"."id" = 5

	def eqpgroup_edit
		@title = "Редактирование элемента бокового меню второго уровня"
		@eqpfamily = Eqpfamily.find(params[:eqpfamily_id])
		@eqpgroup = Eqpgroup.find(params[:id])
---
SELECT "eqpfamilies".* FROM "eqpfamilies" WHERE "eqpfamilies"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = ? LIMIT 1  [["id", "4"]]

	def eqptype_create
		@eqptype = Eqptype.new(params[:eqptype])
		@eqpgroup = Eqpgroup.find(params[:id])
		@eqptype.eqpgroup = @eqpgroup
		@eqptype.indx = 9999
#		respond_to do |format|
#			if @eqptype.save
#				#format.html { redirect_to(@eqpfamily) }
#				format.html { redirect_to( :action => "eqpgroup_show", :id => @eqpgroup, :eqpfamily_id => @eqpgroup.eqpfamily )}
#			else
#				format.html { render :action => "eqptype_new" }
#			end
#		end
		@eqptype.save
---
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "eqptypes" ("created_at", "eqpgroup_id", "indx", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 06 Dec 2011 04:14:27 UTC +00:00], ["eqpgroup_id", 1], ["indx", 9999], ["name", "333"], ["updated_at", Tue, 06 Dec 2011 04:14:27 UTC +00:00]]

	def eqptype_destroy
		@eqpgroup = Eqpgroup.find(params[:id])
		@eqptype = Eqptype.find(params[:eqptype])
		@eqptype.destroy
---
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."id" = ? LIMIT 1  [["id", "20"]]
DELETE FROM "eqptypes" WHERE "eqptypes"."id" = ?  [["id", 20]]

	def eqptype_moveup
		@eqptype = Eqptype.find(params[:id])
		@eqpgroup = @eqptype.eqpgroup
		@eqptype.indx = @eqptype.indx - 3
		@eqptype.save
---
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "eqptypes" SET "indx" = 9996, "updated_at" = '2011-12-06 04:16:28.151407' WHERE "eqptypes"."id" = 3

	def eqptype_update
		@eqpgroup = Eqpgroup.find(params[:eqpgroup_id])
		@eqptype = Eqptype.find(params[:id])
		respond_to do |format|
			if @eqptype.update_attributes(params[:eqptype])
---
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "eqptypes" SET "name" = 'Тип Кухня 011', "img01_file_name" = 'shkaph2.jpg', "img01_content_type" = 'image/jpeg', "img01_file_size" = 222165, "img01_updated_at" = '2011-12-10 13:39:39.187500', "updated_at" = '2011-12-10 13:39:39.531250' WHERE "eqptypes"."id" = 1

	def eqptype_show
		@title = "Просмотр типа товара"
		@eqptype = Eqptype.find(params[:id])
		@eqpgroup = @eqptype.eqpgroup;
		@eqptype.eqps.each do |eqp|
			eqp.indx = @eqptype.eqps.index(eqp)
			eqp.indx = eqp.indx * 2
			eqp.save
---
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "eqps".* FROM "eqps" WHERE "eqps"."eqptype_id" = 3 ORDER BY indx
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."eqpgroup_id" = 10 ORDER BY indx
UPDATE "eqps" SET "indx" = 0, "updated_at" = '2011-12-08 05:19:12.330618' WHERE "eqps"."id" = 9

	def eqptype_edit
		@title = "Редактирование типа товара"
		@eqpgroup = Eqpgroup.find(params[:eqpgroup_id])
		@eqptype = Eqptype.find(params[:id])
---
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."id" = ? LIMIT 1  [["id", "2"]]

	def eqp_new
		@title = "Добавление нового товара"
		@eqp = Eqp.new
		@id = Eqptype.find(params[:id])
		eqptype = @id;
		eqpgroup = Eqpgroup.find(eqptype.eqpgroup)
---
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = 4 LIMIT 1

	def eqp_create
		@eqp = Eqp.new(params[:eqp])
		@eqptype = Eqptype.find(params[:id])
		@eqp.eqptype = @eqptype
		@eqp.indx = 99999
		respond_to do |format|
			if @eqp.save
---
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "eqps" ("created_at", "eqptype_id", "indx", "name", "updated_at", "v1", "v2", "v3", "v4") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

	def eqp_destroy
		@eqp = Eqp.find(params[:id])
		@eqptype = @eqp.eqptype
		@eqp.destroy
---
SELECT "eqps".* FROM "eqps" WHERE "eqps"."id" = ? LIMIT 1  [["id", "9"]]
DELETE FROM "eqps" WHERE "eqps"."id" = ?  [["id", 9]]

	def eqp_moveup
		@eqp = Eqp.find(params[:id])
		@eqptype = @eqp.eqptype
		@eqp.indx = @eqp.indx - 3
		@eqp.save
---
SELECT "eqps".* FROM "eqps" WHERE "eqps"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "eqps" SET "indx" = 99996, "updated_at" = '2011-12-08 05:05:34.122735' WHERE "eqps"."id" = 10

	def eqp_update
		@eqp = Eqp.find(params[:id])
		@eqptype = @eqp.eqptype;
		respond_to do |format|
			if @eqp.update_attributes(params[:eqp])
---
SELECT "eqps".* FROM "eqps" WHERE "eqps"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "eqps" SET "name" = '234', "v1" = '2314', "v2" = '', "v3" = '', "v4" = '', "updated_at" = '2011-12-08 04:56:10.959467' WHERE "eqps"."id" = 5

	def eqp_edit
		@title = "Редактирование товара"
		@eqp = Eqp.find(params[:id])
---
SELECT "eqps".* FROM "eqps" WHERE "eqps"."id" = ? LIMIT 1  [["id", "6"]]