app/controllers/keywords_controller.rb

  def index
    @keywords = Keyword.all
---
SELECT "keywords".* FROM "keywords"

  def show
    @keyword = Keyword.find(params[:id])
---
SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = ? LIMIT 1  [["id", "2"]]

  def destroy
    @keyword = Keyword.find(params[:id])
    @keyword.destroy
---
SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "keywords" WHERE "keywords"."id" = ?  [["id", 2]]