app/controllers/login_controller.rb

  def add_user
    flash.now[:notice] = "Пользователь  зарегистрирован"
  	@user = User.new(params[:user])
  	if request.post? and @user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?)