app/controllers/pages_controller.rb

INSERT INTO "postmails" ("created_at", "email", "fullname", "message", "phone", "recipient", "subject", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def sendmail

	@postmail = Postmail.new(params[:postmail])
	@postmail.recipient = "rosholod@rosholod.khv.ru;mgerasim.mail@gmail.com";
	respond_to do |format|
	    if @postmail.save