app/controllers/postmails_controller.rb

  def index
    @postmails = Postmail.all
---
SELECT "postmails".* FROM "postmails"

  def destroy
    @postmail = Postmail.find(params[:id])
    @postmail.destroy
---
SELECT "postmails".* FROM "postmails" WHERE "postmails"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "postmails" WHERE "postmails"."id" = ?  [["id", 1]]