app/controllers/settings_controller.rb

SELECT "settings".* FROM "settings" LIMIT 1
---
  def index
    @settings = Setting.all

SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @setting = Setting.find(params[:id])

SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @setting = Setting.find(params[:id])

INSERT INTO "settings" ("created_at", "meta_description", "meta_keywords", "site_name", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @setting = Setting.new(params[:setting])

    respond_to do |format|
      if @setting.save

SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "settings" SET "title_main" = 'title, main', "title_service" = 'title, service', "title_price" = 'title, price', "title_contact" = 'title, contact', "title_sendmail" = 'title, sendmail', "updated_at" = '2011-12-23 00:41:33.395625' WHERE "settings"."id" = 1
---
  def update
    @setting = Setting.find(params[:id])

    respond_to do |format|
      if @setting.update_attributes(params[:setting])