app/controllers/store_controller.rb

SELECT "settings".* FROM "settings" LIMIT 1
---
  def index
    @title = Setting.first.title_service

SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."id" = ? LIMIT 1  [["id", "8"]]
---
  def eqpgroup_show
    @eqpgroup = Eqpgroup.find(params[:id])