app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 06 Dec 2011 00:56:10 UTC +00:00], ["email", ""], ["name", "привет"], ["updated_at", Tue, 06 Dec 2011 00:56:10 UTC +00:00]]