app/views/store/eqpgroup_show.html.erb

<table>
	<% @eqpgroup.eqptypes.each do |eqptype| %>
---
SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."eqpgroup_id" = 8 ORDER BY indx