app/views/layouts/_sidebarstore.html.erb

SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."eqpfamily_id" = 5 ORDER BY indx
---
		<ul>
			<% eqpfamily.eqpgroups.each do |eqpgroup| %>