app/views/layouts/_sidebaradmin.html.erb

SELECT "eqpgroups".* FROM "eqpgroups" WHERE "eqpgroups"."eqpfamily_id" = 2 ORDER BY indx
---
		<ul>
			<% eqpfamily.eqpgroups.each do |eqpgroup| %>

SELECT "eqptypes".* FROM "eqptypes" WHERE "eqptypes"."eqpgroup_id" = 10 ORDER BY indx
---
					<ul>
					<% eqpgroup.eqptypes.each do |eqptype| %>